**Terraform Format and Style 🖌**
`success`

**Terraform Initialization ⚙️**
`success`

**Terraform Validate ✅**
`success`

**Terraform Plan 📖**
`success`

<details><summary>Show Plan</summary>

```
terraform
hcloud_ssh_key.default: Refreshing state... [id=2415045]
hcloud_network.internal: Refreshing state... [id=453488]
hcloud_floating_ip.bastion: Refreshing state... [id=369139]
hcloud_server.bastion: Refreshing state... [id=9203449]
hcloud_network_subnet.internal: Refreshing state... [id=453488-10.0.0.0/24]
hcloud_floating_ip_assignment.bastion: Refreshing state... [id=369139]
hcloud_server_network.bastion: Refreshing state... [id=9203449-453488]
google_dns_record_set.bastion: Refreshing state... [id=mhnet-me/bastion.fsn1.mhnet.me./A]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # hcloud_floating_ip_assignment.bastion must be replaced
-/+ resource "hcloud_floating_ip_assignment" "bastion" {
      ~ id             = "369139" -> (known after apply)
      ~ server_id      = 9203449 -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # hcloud_server.bastion must be replaced
-/+ resource "hcloud_server" "bastion" {
      + backup_window = (known after apply)
      ~ datacenter    = "fsn1-dc14" -> (known after apply)
      ~ id            = "9203449" -> (known after apply)
      ~ image         = "28318669" -> "28478027" # forces replacement
      ~ ipv4_address  = "168.119.153.1" -> (known after apply)
      ~ ipv6_address  = "2a01:4f8:1c17:664d::1" -> (known after apply)
      ~ ipv6_network  = "2a01:4f8:1c17:664d::/64" -> (known after apply)
      - labels        = {} -> null
        name          = "bastion.fsn1.mhnet.me"
      ~ status        = "running" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # hcloud_server_network.bastion must be replaced
-/+ resource "hcloud_server_network" "bastion" {
      - alias_ips   = [] -> null
      ~ id          = "9203449-453488" -> (known after apply)
      ~ mac_address = "86:00:00:88:40:88" -> (known after apply)
      ~ server_id   = 9203449 -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```
</details>
Pusher: @mhutter
Action: `pull_request`